In [1]:
pip install Faker --q

Note: you may need to restart the kernel to use updated packages.

In [2]:
from faker import Faker
import pandas as pd
import numpy as np
import secrets

In [3]:
faker = Faker(["en_IN"])

In [4]:
first_names = []
last_name = []
state = []
city = []
postal_code = []
building_name = []
street_name = []
phones = []
for i in range(2500):
    first_names.append(faker.first_name())
    last_name.append(faker.last_name())
    state.append(faker.administrative_unit())
    city.append(faker.city())
    postal_code.append(faker.postcode())
    building_name.append(faker.building_number())
    street_name.append(faker.street_name())
    phones.append(faker.phone_number())

In [5]:
print(len(first_names) ,
len(last_name) ,
len(state) ,
len(city) ,
len(postal_code) ,
len(building_name ),
len(street_name) ,
len(phones))

2500 2500 2500 2500 2500 2500 2500 2500

In [35]:
print(len(first_names))

2500

In [34]:
print(len(last_name))

2500

In [33]:
print(len(phones))

2500

In [32]:
print(len(building_name))

2500

In [31]:
print(len(street_name))

2500

In [30]:
print(len(state))

2500

In [29]:
print(len(city))

2500

In [52]:
id_= []

In [54]:

for i in range(2500):
    id_.append(faker.unique.random_int(min =2500000, max = 3000000))

In [17]:
(pd.Series(id_)).value_counts()

9086    1
1156    1
1196    1
1255    1
1449    1
       ..
9098    1
9497    1
9216    1
9155    1
1443    1
Name: count, Length: 999, dtype: int64

In [18]:
id_.append(9000)
id_.append(9501)

In [55]:
len(id_)

2500

In [27]:
date_of_firstdeal = []
for i in range(2500):
#     print((faker.date_between_dates("-2y", "now")))
    date_of_firstdeal.append(faker.date_between_dates("-2y", "now"))

In [28]:
len(date_of_firstdeal)

2500

In [25]:
print(len(date_of_firstdeal))

2500

In [56]:
df_ = {"id_" : id_ , "first_name"  : first_names , "last_name"  : last_name, "state": state, "city": city, "postal_code": postal_code, "building_name" : building_name , "street_name" : street_name, "phone": phones, "date_of_first_deal" : date_of_firstdeal }

In [57]:
df = pd.DataFrame(df_)
df

,id_,first_name,last_name,state,city,postal_code,building_name,street_name,phone,date_of_first_deal
0,2940339,Inaaya,Chhabra,Madhya Pradesh,Imphal,950745,69,Ramesh Street,08805874833,2023-11-11
1,2960849,Priyansh,Singhal,Meghalaya,Katihar,952299,37,Thakkar Street,+919561516767,2022-11-07
2,2816042,Abram,Sengupta,Meghalaya,Pune,165369,93,Tak Zila,0365278223,2023-10-05
3,2677876,Zeeshan,Setty,Uttar Pradesh,Varanasi,313104,H.No. 636,Tailor Marg,+914212191250,2022-07-10
4,2623799,Ayesha,Dugar,Sikkim,Patiala,878062,H.No. 525,Sem Path,06472181443,2022-09-04
...,...,...,...,...,...,...,...,...,...,...
2495,2982221,Reyansh,Varty,Manipur,Satara,801367,H.No. 051,Sani Nagar,00910833553,2022-06-22
2496,2501091,Rohan,Sibal,Assam,Ichalkaranji,813275,H.No. 16,Lata Marg,3644317563,2022-08-08
2497,2830996,Vaibhav,Mani,Sikkim,Ahmedabad,379788,H.No. 65,Rajagopal Street,9522443440,2023-03-10
2498,2793501,Indranil,Sanghvi,Gujarat,Agra,837737,42/283,Hans Marg,+918670570640,2023-06-28
2499,2580545,Amani,Goda,Telangana,Etawah,792821,45/57,Kamdar Street,7097038588,2023-02-12

In [58]:
df.to_csv("Traders.csv")

In [59]:
employee_first_name = []
employee_last_name = []
date_of_birth = []
for i in range(1095):
    employee_first_name.append(faker.first_name())
    employee_last_name.append(faker.last_name())
    date_of_birth.append(faker.date_between_dates("-54y", "-27y"))

In [60]:
salary = []
department = []
max_qualification =[]

In [61]:
for i in range(540):
    salary.append(20000)
    department.append("labours")
    max_qualification.append("intermediate")
#         labours

In [62]:
for i in range(270):
    department.append("co-workers")
    salary.append(35000)
    max_qualification.append("graduation")
# co-workers

In [63]:
for i in range(5):
    department.append("maneger")
    salary.append(90000)
    max_qualification.append("MBA") 
#         manegers

In [64]:
for i in range(95):
    department.append("driver")
    salary.append(30000)
    max_qualification.append("Not required")
#     driver

In [65]:
for i in range(95):
    department.append("helper")
    salary.append(25000)
    max_qualification.append("Not required")
#     helper

In [66]:
for i in range(30):
    department.append("mechanical engineering")
    salary.append(75000)
    max_qualification.append("B.tech")
#     mahenicle_engineers

In [67]:
for i in range(45):
    department.append("security")
    salary.append(27000)
    max_qualification.append("Not required")
#     security

In [68]:
for i in range(15):
    department.append("technical")
    salary.append(4000)
    max_qualification.append("B.tech or BCA")
#     data_entry and technicals

In [69]:
id_ = []
for i in range(1095):
    id_.append(faker.unique.random_int(min = 100, max = 1195))

In [70]:
print(len(salary))

1095

In [71]:
print(len(department))

1095

In [72]:
print(len(max_qualification))

1095

In [73]:
df_empo = {"id_" : id_, "employee_first_name": employee_first_name, "employee_last_name": employee_last_name, "date_of_birth": date_of_birth, "salary": salary, "department": department , "max_qualification": max_qualification }

In [74]:
df_employee = pd.DataFrame(df_empo)

In [140]:
df_employee.to_csv("employees.csv")

In [76]:
employee_first_name = []
employee_last_name = []
date_of_birth = []
salary = []
department = []
max_qualification =[]

In [77]:
vehicle_id = []
vehicle_registration_date = []
RTO_no_ = []
type_of_vehicle = []
driver_name = []
driver_id = []
helper_name = []
helper_id = []

In [78]:
for i in df_employee["id_"][df_employee["department"] == "driver"]:
    driver_id.append(i)

In [79]:
len(driver_id)

95

In [80]:
for i in df_employee["employee_first_name"][df_employee["department"] == "driver"]:
    driver_name.append(i)

In [81]:
len(driver_name)

95

In [82]:
for i in df_employee["employee_first_name"][df_employee["department"] == "helper"]:
    helper_name.append(i)

In [83]:
for i in df_employee["id_"][df_employee["department"] == "helper"]:
    helper_id.append(i)

In [84]:
for i in range (95):
    vehicle_id.append(faker.license_plate())

In [85]:
for i in range (95):
    vehicle_registration_date.append(faker.date_between_dates("-8y", "now"))

In [86]:
for i in range (95):
    RTO_no_.append(faker.mac_address())

In [87]:
for i in range (50):
    type_of_vehicle.append("Small Type")

In [88]:
for i in range (45):
    type_of_vehicle.append("Big Tpe")

In [89]:
df_vehicle = {"vehicle_id" : vehicle_id, "RTO_no_" : RTO_no_ , "vehicle_registration_date" : vehicle_registration_date, "type_of_vehicle" : type_of_vehicle , "driver_id" : driver_id, "driver_name": driver_name, "helper_id": helper_id, "helper_name" : helper_name}

In [90]:
df_vehicle = pd.DataFrame(df_vehicle)

In [141]:
df_vehicle.to_csv("vehicle.csv")

In [92]:
df_vehicle

,vehicle_id,RTO_no_,vehicle_registration_date,type_of_vehicle,driver_id,driver_name,helper_id,helper_name
0,8SIT592,e8:ce:b4:7f:d0:45,2017-08-04,Small Type,285,Kaira,657,Keya
1,UGP 259,bc:ed:36:a3:dc:25,2021-05-07,Small Type,846,Saira,297,Arhaan
2,X 656506,58:85:07:bc:6b:b0,2016-09-22,Small Type,641,Arnav,722,Bhamini
3,FU9 Y1U,40:11:8b:7b:53:af,2023-11-13,Small Type,140,Indrajit,1015,Elakshi
4,1VQ F64,4a:29:f2:e5:a5:27,2023-10-02,Small Type,545,Priyansh,697,Fateh
...,...,...,...,...,...,...,...,...
90,772 RPW,b4:46:25:38:ec:33,2022-10-24,Big Tpe,202,Adah,381,Vedika
91,KQM-873,dc:6a:f0:3b:24:b9,2020-03-23,Big Tpe,153,Veer,592,Shray
92,033LHT,7a:3a:ec:0c:1b:c2,2017-01-06,Big Tpe,754,Madhav,343,Neysa
93,65-B758,48:bc:ba:bb:f9:92,2017-03-03,Big Tpe,924,Eshani,961,Aradhya
94,DDQ 881,b2:81:21:19:12:f4,2022-09-11,Big Tpe,1067,Kashvi,684,Ahana

In [93]:
payment_id = [1,2,3,4,5,6]
payment_type = ["Credit Card", "Debit Card", "UPI", "Internet Banking", "Cash", "Money Oeder"]

In [94]:
df_payment = {"payment_id" : payment_id, "payment_type": payment_type}

In [95]:
payment_df = pd.DataFrame(df_payment)

In [142]:
payment_df.to_csv("Payment.csv")

In [97]:
df_vehicle = pd.read_csv("vehicle")

In [99]:
df_traders = pd.read_csv("Traders.csv")

In [100]:
df_payment = pd.read_csv("Payment")

In [101]:
df_employees = pd.read_csv("employees")

In [104]:
df_products_names = pd.read_csv("products_names_scraped", index_col = False)

In [105]:
df_products_names.columns

Index(['Unnamed: 0', 'names'], dtype='object')

In [152]:
product_names = []
for i in df_products_names["names"]:
    product_names.append(i)

In [107]:
print(len(product_names))

52

In [108]:
id_ = []
sale_price = []
market_price = []
manufacturing_coast = []
manufacturing_unit = []

In [109]:
print(len(id_),  
len(sale_price), 
len(market_price), 
len(manufacturing_coast), 
len(manufacturing_unit))

0 0 0 0 0

In [110]:
for i in range(52):
    id_.append(faker.random_int(min= 240, max = 295))
    sale_price.append(faker.random_int(min= 450, max = 700))
    market_price.append(faker.random_int(min= 450, max = 700))
    manufacturing_coast.append(faker.random_int(min= 400, max = 650))

In [111]:
for i in range(25):
    manufacturing_unit.append("99")
for i in range(5):
    manufacturing_unit.append("95")
for i in range(5):
    manufacturing_unit.append("96")
for i in range(4):
    manufacturing_unit.append("97")
for i in range(13):
    manufacturing_unit.append("98")

In [112]:
df_products = {"id_": id_, "product_names" : product_names, "sale_price": sale_price, "market_price": market_price, "manufacturing_coast": manufacturing_coast, "manufacturing_unit": manufacturing_unit}

In [113]:
df_product = pd.DataFrame(df_products)

In [114]:
df_product.to_csv("Products.csv")

In [456]:
# print(df_product)

In [115]:
id_u = []
unit_name= ["central unit", "east unit", "west unit", "north unit", "south unit"]
# unit_code = []
unit_year = ["1990", "1996", "1997", "2002", "2006"]
no_empoylee = [350, 250, 350, 100, 45]
unit_address_building_number = []
unit_address_street_name = []
unit_address_street_address = []

In [116]:
print(len(id_u), len(unit_name), len(unit_year), len(no_empoylee), len(unit_address_building_number), len(unit_address_street_name), len(unit_address_street_address))

0 5 5 5 0 0 0

In [117]:
for i in range (5):
    id_u.append(faker.unique.random_int( min = 95 , max = 99))
    unit_address_building_number.append(faker.building_number())
    unit_address_street_name.append(faker.street_name())
    unit_address_street_address.append(faker.street_address())

In [118]:
units = {"id_": id_u, "unit_name": unit_name, "unit_year": unit_year, "no_empoylee": no_empoylee, "unit_address_building_number": unit_address_building_number , "unit_address_street_name": unit_address_street_name, "unit_address_street_address" : unit_address_street_address}

In [119]:
df_units = pd.DataFrame(units)

In [120]:
df_units.to_csv("Unites.csv")

In [121]:
df_units

,id_,unit_name,unit_year,no_empoylee,unit_address_building_number,unit_address_street_name,unit_address_street_address
0,97,central unit,1990,350,H.No. 27,Luthra Chowk,"05, Deep"
1,96,east unit,1996,250,15/450,Kibe Marg,67/09\nKashyap Nagar
2,95,west unit,1997,350,H.No. 71,Shanker Path,32/04\nBrar Street
3,99,north unit,2002,100,90/343,Edwin Road,"H.No. 96, Brar Nagar"
4,98,south unit,2006,45,H.No. 123,Thakkar Ganj,"338, Jhaveri"

In [122]:
id_ = []
company_name = []
city = []
state = []
postal_code = []
# country =[]
phone = []
email =[]

In [123]:
for i in range(25):
    id_.append(faker.unique.random_int(min = 450, max = 475))
    company_name.append(faker.company())
    city.append(faker.city())
    state.append(faker.state())
    postal_code.append(faker.postcode())
#     country.append(faker.country())
    phone.append(faker.phone_number())
    email.append(faker.email())

In [124]:
df_suppliers= {"id_" : id_, "company_name": company_name, "city": city, "state": state, "postal_code": postal_code, "phone": phone, "email": email}

In [125]:
df_supplier = pd.DataFrame(df_suppliers)

In [126]:
df_supplier.to_csv("Suppliers.csv")

In [127]:
df_supplier

,id_,company_name,city,state,postal_code,phone,email
0,471,Zachariah PLC,Jalandhar,Punjab,448740,2650751385,mirayabhardwaj@example.org
1,459,"Arora, Deep and Brahmbhatt",Tadipatri,Punjab,178368,+915306107921,rbose@example.org
2,461,Buch Inc,Korba,Himachal Pradesh,766120,+911829157824,indranilsehgal@example.org
3,450,"Sinha, Bajaj and Ratta",Indore,Haryana,291709,+917124962344,kgokhale@example.net
4,473,"Samra, Sami and Khatri",Tirunelveli,Kerala,280822,+919610456296,aroratanya@example.com
5,462,Wason PLC,Berhampur,Tripura,436376,+918498140442,jayantdeshpande@example.net
6,472,"Loke, Dubey and Gaba",Kamarhati,Himachal Pradesh,988199,1471349361,bhavin16@example.com
7,463,Atwal Inc,Durg,Kerala,590357,+910994297898,daraprisha@example.com
8,457,Dada Group,Khandwa,Andhra Pradesh,225703,06609318713,kabir43@example.net
9,465,Behl-Mandal,Pali,Uttarakhand,151600,0909622239,ctak@example.com
10,470,Mane-Grover,Kavali,Sikkim,379423,+911868491649,oorja33@example.com
11,469,Dada Inc,Rajkot,Odisha,778363,7821595796,trisha59@example.org
12,452,"Verma, Barad and Sridhar",Tadipatri,Karnataka,565898,1246720088,sana85@example.org
13,453,"Kurian, Sami and Bhardwaj",Sikar,Assam,718985,7213482750,ramachandranakarsh@example.com
14,468,Savant-Dutt,Cuttack,Chhattisgarh,894017,8509762892,shanaya94@example.com
15,458,"Rau, Som and Sachar",Mahbubnagar,Madhya Pradesh,631630,3627555151,ishita34@example.com
16,475,"Yogi, Rout and Keer",Dhanbad,Tripura,240671,+914351270324,romilwadhwa@example.com
17,460,Dubey-Bakshi,Bulandshahr,Rajasthan,790607,+910689409405,arnav99@example.com
18,456,"Sangha, Khalsa and Swamy",Satara,Sikkim,006217,+911091808031,zgala@example.com
19,464,"Dube, Choudhry and Sangha",Sri Ganganagar,Rajasthan,227084,4203271914,sundaramdiya@example.net
20,467,"Bhatt, Cheema and Kumar",Chinsurah,Odisha,722780,9010236389,hanskrish@example.com
21,466,Bose PLC,Surat,Sikkim,143444,08870293931,sumerkohli@example.org
22,455,Bali PLC,Pune,Manipur,836916,05350825770,oorja61@example.org
23,451,Sama-Manne,New Delhi,Manipur,266132,0796579064,bhamini69@example.org
24,454,"Dua, Varma and Bala",Coimbatore,Telangana,993101,3017168918,samaira49@example.org

In [128]:
df_units

,id_,unit_name,unit_year,no_empoylee,unit_address_building_number,unit_address_street_name,unit_address_street_address
0,97,central unit,1990,350,H.No. 27,Luthra Chowk,"05, Deep"
1,96,east unit,1996,250,15/450,Kibe Marg,67/09\nKashyap Nagar
2,95,west unit,1997,350,H.No. 71,Shanker Path,32/04\nBrar Street
3,99,north unit,2002,100,90/343,Edwin Road,"H.No. 96, Brar Nagar"
4,98,south unit,2006,45,H.No. 123,Thakkar Ganj,"338, Jhaveri"

In [129]:
df_product

,id_,product_names,sale_price,market_price,manufacturing_coast,manufacturing_unit
0,278,AquaKraft Plastic Bathroom Fittings,472,509,561,99
1,262,Rainbow Rainwater Gutter Pipe,564,698,624,99
2,276,UPVC Pressure Pipes And Fittings,459,491,493,99
3,257,Aqua Gold UPVC Pipes And Fittings,664,656,492,99
4,263,Column Pipes For Submersible Pumps - PVC,539,496,566,99
5,283,Safegard Plastic Septic Tanks,608,455,461,99
6,251,SWR Pipe And Drainage System,659,697,572,99
7,285,FlameGuard® C-PVC Fire Sprinkler System,507,633,465,99
8,277,Cableshield - Electrical Conduit Pipe,593,604,452,99
9,246,Siltank\tOverhead Water Tanks & Loft Tanks,637,660,441,99
10,263,WeatherShield\tPremium Overhead Water Storage ...,474,548,445,99
11,266,Safegard Packaged Sewage Treatment Plants,457,655,485,99
12,264,Raingain - Rainwater Harvesting Filter,632,461,532,99
13,266,Streamline\tSWR Drainage System For Affordable...,500,662,611,99
14,262,Aquatic Premium Bath Fittings,456,467,474,99
15,289,PE Column Pipes For Submersible Pumps,693,596,517,99
16,275,Cableguard DWC HDPE Cable Duct Pipes,691,562,439,99
17,279,Polyethylene Piping System - Polyethylene Pipe...,505,625,514,99
18,248,UPVC High Pressure Pipes - ASTM Threaded Pipes,634,494,514,99
19,281,Cleanage - Readymade Toilet Blocks,668,604,432,99
20,261,Casing Pipes,620,456,641,99
21,269,Varsha Sprinkler Pipe Irrigation System,629,534,574,99
22,244,PVC Garden Pipe And Braided Hose,451,536,527,99
23,240,Lifeline CPVC Hot & Cold Water - CTS Series,482,535,593,99
24,286,Skyrise\tHi-Tech Low Noise SWR Drainage System,540,660,631,99
25,262,Amrutam Underground Water Storage Tanks,594,634,502,95
26,245,Casing Pipes As Per ASTM D 1785,532,558,445,95
27,265,Ecosil Overhead Water Tanks,466,690,603,95
28,272,Nu-Drain Readymade Inspection Chambers,597,525,476,95
29,244,LifelinePlus C-PVC Hot & Cold Water System - I...,647,595,544,95
30,250,Cleanage Readymade Urinals - Public Men's Urinals,532,468,494,96
31,254,CopperSheild Water Tanks,459,689,409,96
32,271,Indo Green PPR Pipes - Hot & Cold Water System,617,662,622,96
33,250,Supreme PP-R Pipes & Fittings,462,459,479,96
34,286,SDR Casing Pipes,696,609,534,96
35,291,Ultra Manholes Chambers,688,464,546,97
36,240,Silbond Solvent Cements,474,655,551,97
37,276,Ribbed Screen Casing Pipes,574,672,451,97
38,251,"Nu-Drain Solid Wall Pipes, Fittings & Accessories",487,501,594,97
39,261,Silaid Rubber Lubricant,553,632,465,98
40,265,Screen Pipes / Slotted Pipes,684,598,493,98
41,295,PVC Drain Pipe - Hi-Tech Structured Wall Plast...,556,525,452,98
42,271,Bluesil Thread Sealant,528,520,578,98
43,252,Accessories For Borewell Application,595,560,600,98
44,280,Foam Core\tStructured Wall Pipes,567,654,508,98
45,256,Ultra Plus DWC Structured Wall Pipes & Fitting...,605,478,514,98
46,257,E-lite Advance Plumbing System,462,490,503,98
47,285,High-density Polyethylene (HDPE) Pipes For Sew...,465,460,566,98
48,255,ECOLINE Pipes For Reclaimed Water,581,462,640,98
49,266,UltraGard Composite Manhole Cover & Gratings,643,535,609,98
50,277,Supreme PE Electro-fusion Fittings,582,647,587,98
51,281,Compression Fittings,614,450,587,98

In [130]:
payment_df

   payment_id      payment_type
0           1       Credit Card
1           2        Debit Card
2           3               UPI
3           4  Internet Banking
4           5              Cash
5           6       Money Oeder

In [131]:
df_vehicle

,Unnamed: 0,vehicle_id,RTO_no_,vehicle_registration_date,type_of_vehicle,driver_id,driver_name,helper_id,helper_name
0,0,8SIT592,e8:ce:b4:7f:d0:45,2017-08-04,Small Type,285,Kaira,657,Keya
1,1,UGP 259,bc:ed:36:a3:dc:25,2021-05-07,Small Type,846,Saira,297,Arhaan
2,2,X 656506,58:85:07:bc:6b:b0,2016-09-22,Small Type,641,Arnav,722,Bhamini
3,3,FU9 Y1U,40:11:8b:7b:53:af,2023-11-13,Small Type,140,Indrajit,1015,Elakshi
4,4,1VQ F64,4a:29:f2:e5:a5:27,2023-10-02,Small Type,545,Priyansh,697,Fateh
...,...,...,...,...,...,...,...,...,...
90,90,772 RPW,b4:46:25:38:ec:33,2022-10-24,Big Tpe,202,Adah,381,Vedika
91,91,KQM-873,dc:6a:f0:3b:24:b9,2020-03-23,Big Tpe,153,Veer,592,Shray
92,92,033LHT,7a:3a:ec:0c:1b:c2,2017-01-06,Big Tpe,754,Madhav,343,Neysa
93,93,65-B758,48:bc:ba:bb:f9:92,2017-03-03,Big Tpe,924,Eshani,961,Aradhya
94,94,DDQ 881,b2:81:21:19:12:f4,2022-09-11,Big Tpe,1067,Kashvi,684,Ahana

In [132]:
df_traders

,Unnamed: 0,id_,first_name,last_name,state,city,postal_code,building_name,street_name,phone,date_of_first_deal
0,0,2940339,Inaaya,Chhabra,Madhya Pradesh,Imphal,950745,69,Ramesh Street,8805874833,2023-11-11
1,1,2960849,Priyansh,Singhal,Meghalaya,Katihar,952299,37,Thakkar Street,919561516767,2022-11-07
2,2,2816042,Abram,Sengupta,Meghalaya,Pune,165369,93,Tak Zila,365278223,2023-10-05
3,3,2677876,Zeeshan,Setty,Uttar Pradesh,Varanasi,313104,H.No. 636,Tailor Marg,914212191250,2022-07-10
4,4,2623799,Ayesha,Dugar,Sikkim,Patiala,878062,H.No. 525,Sem Path,6472181443,2022-09-04
...,...,...,...,...,...,...,...,...,...,...,...
2495,2495,2982221,Reyansh,Varty,Manipur,Satara,801367,H.No. 051,Sani Nagar,910833553,2022-06-22
2496,2496,2501091,Rohan,Sibal,Assam,Ichalkaranji,813275,H.No. 16,Lata Marg,3644317563,2022-08-08
2497,2497,2830996,Vaibhav,Mani,Sikkim,Ahmedabad,379788,H.No. 65,Rajagopal Street,9522443440,2023-03-10
2498,2498,2793501,Indranil,Sanghvi,Gujarat,Agra,837737,42/283,Hans Marg,918670570640,2023-06-28
2499,2499,2580545,Amani,Goda,Telangana,Etawah,792821,45/57,Kamdar Street,7097038588,2023-02-12

In [133]:
df_employees

,Unnamed: 0,id_,employee_first_name,employee_last_name,date_of_birth,salary,department,max_qualification
0,0,980,Kaira,Samra,1976-01-01,20000,labours,intermediate
1,1,218,Vanya,Bhavsar,1990-10-18,20000,labours,intermediate
2,2,503,Azad,Vora,1985-06-12,20000,labours,intermediate
3,3,400,Lagan,Tripathi,1973-12-20,20000,labours,intermediate
4,4,600,Nirvi,Chaudhari,1978-03-19,20000,labours,intermediate
...,...,...,...,...,...,...,...,...
1090,1090,474,Shray,Kakar,1975-12-30,4000,technical,B.tech or BCA
1091,1091,1007,Pari,Jhaveri,1996-02-22,4000,technical,B.tech or BCA
1092,1092,767,Azad,Bajwa,1974-09-01,4000,technical,B.tech or BCA
1093,1093,734,Dharmajan,Garg,1988-05-12,4000,technical,B.tech or BCA
1094,1094,936,Shray,Varma,1987-07-31,4000,technical,B.tech or BCA

In [134]:
df_sale

NameError: name 'df_sale' is not defined

In [135]:
# sale
id_ = []
for i in range(10000):
    id_.append(faker.unique.random_int(min = 120000, max= 140000))

In [144]:
len(id_)

10000

In [161]:
trader_id = []
product_id = []
quantity = []
supplier_id = []
payment_id = []
date_of_order = []

In [165]:
print(len(date_of_order)
,len(payment_id),
len(supplier_id)
,len(quantity)
,len(product_id)
,len(trader_id))

10000 10000 10000 10000 10000 10000

In [162]:
for i in range(10000):
    trader_id.append(secrets.choice(df_traders["id_"]))
    product_id.append(secrets.choice(df_products["id_"]))
    supplier_id.append(secrets.choice(df_supplier["id_"]))
    product_names.append(secrets.choice(df_products["product_names"]))
    payment_id.append(secrets.choice(df_payment["payment_id"]))

In [164]:
for i in range(10000):
    quantity.append(faker.random_int(min= 1, max = 70))
    date_of_order.append(faker.date_between_dates("-2y", "now"))

In [166]:
df_sales = {"id_": id_ , "trader_id": trader_id, "product_id": product_id, "quantity": quantity,  "supplier_id": supplier_id, "payment_id": payment_id, "date_of_order": date_of_order}

In [167]:
df_sale = pd.DataFrame(df_sales)

In [188]:
df_sale.to_csv("Sales.csv")

In [187]:
df_employee = pd.read_csv("employees.csv")
# df_employee

In [186]:
df_Payment = pd.read_csv("Payment.csv")
# df_Payment

In [185]:
df_Sales = pd.read_csv("Sales.csv")
# df_Sales

In [184]:
df_Suppliers = pd.read_csv("Suppliers.csv")
# df_Suppliers

In [181]:
df_Traders = pd.read_csv("Traders.csv")
# df_Traders

In [178]:
df_vehicle = pd.read_csv("vehicle.csv")
# df_vehicle

In [388]:
# df_Unites["unit_code"].astype("int")
# df_Unites = df_Unites.astype({'unit_code': "int64"})

In [389]:
# df_Unites.info()

In [175]:
df_Manufacturing_Unites = pd.read_csv("Unites.csv")
df_Manufacturing_Unites

,Unnamed: 0,id_,unit_name,unit_year,no_empoylee,unit_address_building_number,unit_address_street_name,unit_address_street_address
0,0,97,central unit,1990,350,H.No. 27,Luthra Chowk,"05, Deep"
1,1,96,east unit,1996,250,15/450,Kibe Marg,67/09\nKashyap Nagar
2,2,95,west unit,1997,350,H.No. 71,Shanker Path,32/04\nBrar Street
3,3,99,north unit,2002,100,90/343,Edwin Road,"H.No. 96, Brar Nagar"
4,4,98,south unit,2006,45,H.No. 123,Thakkar Ganj,"338, Jhaveri"

In [174]:
df_Products = pd.read_csv("Products.csv")
# df_Products

In [336]:
pip install mysql-connector-python --q

Note: you may need to restart the kernel to use updated packages.

In [337]:
pip install pandas sqlalchemy --q

Note: you may need to restart the kernel to use updated packages.

In [148]:
import mysql.connector

# Define MySQL connection parameters
DB_USER = 'root'
DB_PASSWORD = 'Sarvagy7.7'
DB_HOST = '127.0.0.1'

# Connect to MySQL server
connection = mysql.connector.connect(
    host="127.0.0.1",
    user="root",
    password="Sarvagya7.7"
)

# Create a new database
new_database_name = 'Raksha_Pipes'
cursor = connection.cursor()
cursor.execute(f"CREATE DATABASE IF NOT EXISTS {new_database_name}")

print(f"Database '{new_database_name}' created successfully!")

# Close cursor and connection
cursor.close()
connection.close()

Database 'Raksha_Pipes' created successfully!

In [149]:
from sqlalchemy import create_engine

# Define MySQL connection parameters
DB_USER = 'your_username'
DB_PASSWORD = 'your_password'
DB_HOST = 'localhost'
DB_PORT = '3306'
DB_NAME = 'your_database_name'

# Create SQLAlchemy engine
engine = create_engine(f"mysql+mysqlconnector://root:Sarvagya7.7@127.0.0.1:3306/Raksha_Pipes")

# Define table name
table_name = "Employee"

# Load DataFrame into MySQL database
df_employee.to_sql(name=table_name, con=engine, if_exists='replace', index=False)

print("DataFrame loaded into MySQL database successfully!")

DataFrame loaded into MySQL database successfully!

C:\Users\cools\AppData\Local\Temp\ipykernel_13348\1722909017.py:17: UserWarning: The provided table name 'Employee' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  df_employee.to_sql(name=table_name, con=engine, if_exists='replace', index=False)

In [182]:
df_Traders.to_sql(name= "Traders", con=engine, if_exists='replace', index=False)

print("DataFrame loaded into MySQL database successfully!")

DataFrame loaded into MySQL database successfully!

C:\Users\cools\AppData\Local\Temp\ipykernel_13348\3608085011.py:1: UserWarning: The provided table name 'Traders' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  df_Traders.to_sql(name= "Traders", con=engine, if_exists='replace', index=False)

In [173]:
df_Products.to_sql(name="Products", con=engine, if_exists='replace', index=False)

print("DataFrame loaded into MySQL database successfully!")

DataFrame loaded into MySQL database successfully!

C:\Users\cools\AppData\Local\Temp\ipykernel_13348\2289308193.py:1: UserWarning: The provided table name 'Products' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  df_Products.to_sql(name="Products", con=engine, if_exists='replace', index=False)

In [176]:
df_Manufacturing_Unites.to_sql(name="Unites", con=engine, if_exists='replace', index=False)

print("DataFrame loaded into MySQL database successfully!")

DataFrame loaded into MySQL database successfully!

C:\Users\cools\AppData\Local\Temp\ipykernel_13348\248447407.py:1: UserWarning: The provided table name 'Unites' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  df_Manufacturing_Unites.to_sql(name="Unites", con=engine, if_exists='replace', index=False)

In [179]:
df_vehicle.to_sql(name="Vehicle", con=engine, if_exists='replace', index=False)

print("DataFrame loaded into MySQL database successfully!")

DataFrame loaded into MySQL database successfully!

C:\Users\cools\AppData\Local\Temp\ipykernel_13348\941668179.py:1: UserWarning: The provided table name 'Vehicle' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  df_vehicle.to_sql(name="Vehicle", con=engine, if_exists='replace', index=False)

In [189]:
df_Suppliers.to_sql(name="Suppliers", con=engine, if_exists='replace', index=False)

print("DataFrame loaded into MySQL database successfully!")

DataFrame loaded into MySQL database successfully!

C:\Users\cools\AppData\Local\Temp\ipykernel_13348\3562767808.py:1: UserWarning: The provided table name 'Suppliers' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  df_Suppliers.to_sql(name="Suppliers", con=engine, if_exists='replace', index=False)

In [190]:
df_Sales.to_sql(name="Sales", con=engine, if_exists='replace', index=False)

print("DataFrame loaded into MySQL database successfully!")

DataFrame loaded into MySQL database successfully!

C:\Users\cools\AppData\Local\Temp\ipykernel_13348\155728395.py:1: UserWarning: The provided table name 'Sales' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  df_Sales.to_sql(name="Sales", con=engine, if_exists='replace', index=False)

In [191]:
df_Payment.to_sql(name="Payments", con=engine, if_exists='replace', index=False)

print("DataFrame loaded into MySQL database successfully!")

DataFrame loaded into MySQL database successfully!

C:\Users\cools\AppData\Local\Temp\ipykernel_13348\3228423691.py:1: UserWarning: The provided table name 'Payments' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  df_Payment.to_sql(name="Payments", con=engine, if_exists='replace', index=False)

In [ ]:
# engine = create_engine(f"mysql+mysqlconnector://{DB_USER}:{DB_PASSWORD}@{DB_HOST}/{DB_NAME}")

query = "SELECT * FROM your_table_name"
df = pd.read_sql(query, engine)